huyngovn1/STM32H563RGTx_BMP580/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

#include "stm32h5xx_ll_rcc.h"
#include "stm32h5xx_ll_spi.h"
#include "stm32h5xx_ll_tim.h"
#include "stm32h5xx_ll_system.h"
#include "stm32h5xx_ll_gpio.h"
#include "stm32h5xx_ll_exti.h"
#include "stm32h5xx_ll_bus.h"
#include "stm32h5xx_ll_cortex.h"
#include "stm32h5xx_ll_utils.h"
#include "stm32h5xx_ll_pwr.h"
#include "stm32h5xx_ll_dma.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define INT_BMP_Pin LL_GPIO_PIN_13
#define INT_BMP_GPIO_Port GPIOC
#define LED1_Pin LL_GPIO_PIN_14
#define LED1_GPIO_Port GPIOC
#define LED2_Pin LL_GPIO_PIN_15
#define LED2_GPIO_Port GPIOC
#define IMU_CS_Pin LL_GPIO_PIN_4
#define IMU_CS_GPIO_Port GPIOA
#define IMU_INT_Pin LL_GPIO_PIN_5
#define IMU_INT_GPIO_Port GPIOC
#define CSB_Pin LL_GPIO_PIN_2
#define CSB_GPIO_Port GPIOB
#define CSB_MAG_Pin LL_GPIO_PIN_12
#define CSB_MAG_GPIO_Port GPIOB
#define DRDY_MAG_Pin LL_GPIO_PIN_13
#define DRDY_MAG_GPIO_Port GPIOB
#define IMU2_CS_Pin LL_GPIO_PIN_9
#define IMU2_CS_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
